---
title: 이거 안하면 무슨 일이 일어나나요? - 회고를 통해 목표를 돌아보기
date: 2023-02-10
tags: blog
category: blog
toc: false
---

중요한 질문입니다. 목표를 정해두고 그 목표를 달성하기 위해 집중하다보면, 종종 왜 그걸 해야하는지 잊을 때가 있는데요. 그럴 때 이 질문을 해봐야합니다.

1. 목표를 세울 때는 몰랐던 문제를 만나는 경우

일을 진행하다보면 처음 목표를 세울 때는 예상하지 못한 문제를 만나기도 합니다. 작은 문제라면 헤쳐나가면 되는데, 목표 달성의 효과 비해 훨씬 어렵고 큰 문제를 만날 때도 있습니다. 목표를 세울 때 이 문제를 풀어야한다는 걸 알았다면 아마 다른 목표를 세웠을 만큼 어려운 문제인데도, 이미 문제를 맞닥뜨린 우리는 그만둘 생각을 못하는 경우가 있습니다. 보통은 목표를 위해 시간과 스스로를 갈아서.. 해결하기도 하는데요. 정말 그럴만한 가치가 있는지 생각해봐야합니다.

2. 수단이 목적이 되는 경우

목표를 달성 하기 위한 수단 자체 목적이 되기도 합니다. 예를 들면 A를 위해서 B를 도입해야한다고 생각했는데, 나중에 알고보니 B를 도입해도 A가 해결되지 않는 거죠. 그러면 거기서, 어쨌든 B를 하면 C나 D가 되니까 하자고 하는 경우가 있습니다.

그럴 때는 C, D가 달성해야할 만큼 중요한지 충분히 고민하고, 필요하다면 목표를 바꾸면 됩니다. 대신 A를 계속 목표로 둘 것인지, 그렇다면 어떻게 할 것인지 고민을 해봐야겠죠.

지금 하는 일을 중단하는 거나 목표를 바꾸는 건 잘못된 일이 아닙니다. 오히려 이 일을 하면 어떤 일이 일어나는지 멈춰서서 고민해보고, 필요하면 방향을 바꿔야합니다. 다 알고 목표를 세울 수는 없으니까요.

제가 있는 팀에서는 분기마다 목표를 세우고 한 분기에 세 번 회고를 하는데요. 분기 중간 쯤에 OKR 중간 회고를 하고, 나머지 두번은 업무를 처리하며 배운 점, 아쉬운 점 등을 공유하는 업무 회고를 하고 있습니다. 일하는 방식에 변화가 필요하다면 바꾸고, 어떤 대응 일감이 필요하다면 만듭니다. (쓰다 보니 다음 번에는 회고 자체에 대해서 글을 써봐야겠네요.)

일을 하는 도중에는 잘못된 방향으로 가는 걸 알아채기 어렵습니다. 그러니 잠시 멈춰서서 회고를 통해 잘 가고 있는지, 얼만큼 왔는지, 그리고 꼭 가야하는지에 대해 고민해봐야합니다.

- 얼마전에 회고를 했는데 이 질문이 떠올라서 팀과 같이 고민해보고, 이렇게 글도 써봤습니다.
